// Поясніть своїми словами, як ви розумієте, що таке деструктуризація і навіщо вона потрібна
// Деструктуризація - це вид синтаксису, за допомогою якого є можливість присвоїти до об'єкту чи масиву відразу декілька елементів.
// Вона потрібна для розпакування об'єкту чи масиву на окремі елементи та присвоїти в іншу.

const clients1 = [
  "Гилберт",
  "Сальваторе",
  "Пирс",
  "Соммерс",
  "Форбс",
  "Донован",
  "Беннет",
];
const clients2 = ["Пирс", "Зальцман", "Сальваторе", "Майклсон"];

// const result = [...clients1, ...clients2];
// const rusultClients = (element) => {
//   let seen = [];
//   for (str of element) {
//     if (!seen.includes(str)) {
//       seen.push(str);
//     }
//   }
//   return seen;
// };
// console.log(rusultClients(result));

let res = [new Set([...clients1, ...clients2])];

console.log(res);
